---
type: TriangulationInterfaceForTriangulatedShellComponent
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# TriangulationInterfaceForTriangulatedShellComponent

`Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TriangulationInterfaceForTriangulatedShellComponent | 2013 | `public TriangulationInterfaceForTriangulatedShellComponent ( TriangulatedShellComponent externalTriangulatedShellComponent )` |